export default {
  zod: {
    required: 'هذه الحقل مطلوب',
    invalid: 'غير صالح',
    invalidType: 'نوع بيانات غير صالح',
    invalidInput: 'ادخال غير صالح',
    invalidArguments: 'وسيطات دالة غير صالحة',
    invalidReturnType: 'نوع إرجاع دالة غير صالح',
    invalidDate: 'تاريخ غير صالح',
    invalidIntersectionTypes: 'تعذر دمج نتائج التقاطع',
  },

  loginFailed: 'لا يمكن تسجيل الدخول باستعمال اسم المستخدم وكلمة السر هذه',
  serverError: 'ثمتة خطأ ما، يا للهول 😂',
  usernameExists: 'اسم المستخدم هذه مسجل',
  unknownError: 'خطأ غير معروف',
  oldPasswordWrong: 'كلمة السر القديمة غير صحيحة',
  passwordUpdated: 'تم تعديم كلمة السر الخاصة بك',
};
